#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/samuelleezy-hashicorp-demo/gh-actions-demo/runs/run-9f5QtBGBcKkN8CBP

Waiting for the plan to start...

Terraform v1.2.5
on linux_amd64
Initializing plugins and modules...
data.aws_ami.ubuntu: Reading...
data.aws_ami.ubuntu: Read complete after 1s [id=ami-048a2d001938101dd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                          = "ami-048a2d001938101dd"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name" = "MMC-gh-actions-demo-1"
        }
      + tenancy                      = (known after apply)
      + user_data                    = "e86ad342e3942d7481a9789adf4b295cae4022ec"
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.web-sg will be created
  + resource "aws_security_group" "web-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # random_pet.sg will be created
  + resource "random_pet" "sg" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + web-address = (known after apply)

------------------------------------------------------------------------

Cost Estimation:

Resources: 1 of 1 estimated
           $8.6304/mo +$8.6304

------------------------------------------------------------------------

Organization Policy Check:

================= Results for policy set: sentinel-policy-demo =================

Sentinel Result: true

This result means that all Sentinel policies passed and the protected
behavior is allowed.

2 policies evaluated.

## Policy 1: sentinel-policy-demo/restrict-aws-instances-type-and-tag (advisory)

Result: false (allowed failure based on level)

./restrict-aws-instances-type-and-tag.sentinel:25:1 - Rule "main"
  Description:
    Main rule that requires other rules to be true

  Value:
    false

./restrict-aws-instances-type-and-tag.sentinel:18:1 - Rule "instance_type_allowed"
  Description:
    Rule to restrict instance types

  Value:
    false

## Policy 2: sentinel-policy-demo/limit-cost-by-workspace-name (soft-mandatory)

Result: true

Description:
  This policy uses the Sentinel tfrun import to restrict the  proposed monthly cost that would be incurred if the current  plan were applied, using different limits for different  workspaces based on their names.

Print messages:

Proposed monthly cost 8.6304 of workspace gh-actions-demo is under the limit: $ 50

./limit-cost-by-workspace-name.sentinel:70:1 - Rule "main"
  Description:
    Main rule

  Value:
    true



```

</details>

*Pushed by: @samuellee-zy, Action: `pull_request`*